In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Akshay','Neha','Swati','Vedant','Satish',
                'Mitali','Ashwini'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }

In [3]:
df1 =pd.DataFrame(dict1)

In [4]:
df1

      Name  Marks  Gender
0   Akshay     98    Male
1     Neha     89  Female
2    Swati     99  Female
3   Vedant     87    Male
4   Satish     90    Male
5   Mitali     83  Female
6  Ashwini     99  Female

>Display Top 4 Rows

In [5]:
df1.head(4)

     Name  Marks  Gender
0  Akshay     98    Male
1    Neha     89  Female
2   Swati     99  Female
3  Vedant     87    Male

>Display Below 3 Rows

In [6]:
df1.tail(3)

      Name  Marks  Gender
4   Satish     90    Male
5   Mitali     83  Female
6  Ashwini     99  Female

>Find shape of Dataset and Display no. of rows and columns

In [7]:
df1.shape

(7, 3)

In [8]:
print( 'No. of Row:',df1.shape[0])
print('No. of Column:',df1.shape[1])

No. of Row: 7
No. of Column: 3

>How to Get information about No. of rows ,total no. of columns, Datatypes of each column and memory Requirement

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

>Check Null values from Dataset

In [10]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

>Get overall Statistic About the DataFrame

In [11]:
df1.describe(include = 'all')

          Name      Marks  Gender
count        7   7.000000       7
unique       7        NaN       2
top     Mitali        NaN  Female
freq         1        NaN       4
mean       NaN  92.142857     NaN
std        NaN   6.491753     NaN
min        NaN  83.000000     NaN
25%        NaN  88.000000     NaN
50%        NaN  90.000000     NaN
75%        NaN  98.500000     NaN
max        NaN  99.000000     NaN

>Find the Unique values from Gender Column.

In [12]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

>Find the Number of Unique value from Gender Column

In [13]:
df1['Gender'].nunique

<bound method IndexOpsMixin.nunique of 0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object>

>Find the count of unique value from Gender Column

In [14]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

>Find the Number of student having marks between 90 to 100 (inclusive)using Between method

In [15]:
df1[df1['Marks'] >= 90]

      Name  Marks  Gender
0   Akshay     98    Male
2    Swati     99  Female
4   Satish     90    Male
6  Ashwini     99  Female

In [16]:
len(df1[(df1['Marks']>=90) & (df1['Marks'] <=100)])

4

### or we can use __between__ method

In [17]:
sum(df1['Marks'].between(90,100))

4

## Apply Method

In [18]:
def Marks(x):
    return x/2

In [19]:
df1['Marks'].apply(Marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

### Here we will add half marks column in df1

In [20]:
df1['Half Marks']= df1['Marks'].apply(Marks)

In [21]:
df1

      Name  Marks  Gender  Half Marks
0   Akshay     98    Male        49.0
1     Neha     89  Female        44.5
2    Swati     99  Female        49.5
3   Vedant     87    Male        43.5
4   Satish     90    Male        45.0
5   Mitali     83  Female        41.5
6  Ashwini     99  Female        49.5

### Lambda Function

In [22]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

Now we will find length of string of __Name__ column

In [23]:
df1["Name"].apply(len)

0    6
1    4
2    5
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

## Map Functions

In [24]:
df1

      Name  Marks  Gender  Half Marks
0   Akshay     98    Male        49.0
1     Neha     89  Female        44.5
2    Swati     99  Female        49.5
3   Vedant     87    Male        43.5
4   Satish     90    Male        45.0
5   Mitali     83  Female        41.5
6  Ashwini     99  Female        49.5

In [25]:
df1['Gender'].map({'Male' : 1, 'Female' : 0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

wil add in Datasets

In [26]:
df1['Male_Female'] = df1['Gender'].map({'Male' : 1, 'Female' : 0})

In [27]:
df1

      Name  Marks  Gender  Half Marks  Male_Female
0   Akshay     98    Male        49.0            1
1     Neha     89  Female        44.5            0
2    Swati     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Satish     90    Male        45.0            1
5   Mitali     83  Female        41.5            0
6  Ashwini     99  Female        49.5            0

## Drop the Columns

For Single Column

In [28]:
df1.drop('Male_Female',axis = 1)

      Name  Marks  Gender  Half Marks
0   Akshay     98    Male        49.0
1     Neha     89  Female        44.5
2    Swati     99  Female        49.5
3   Vedant     87    Male        43.5
4   Satish     90    Male        45.0
5   Mitali     83  Female        41.5
6  Ashwini     99  Female        49.5

For Multiple Columns

In [29]:
df1.drop(['Half Marks','Male_Female'],axis = 1,inplace = True)  #inplace is use to modfiy the data from current dataFrame

In [30]:
df1

      Name  Marks  Gender
0   Akshay     98    Male
1     Neha     89  Female
2    Swati     99  Female
3   Vedant     87    Male
4   Satish     90    Male
5   Mitali     83  Female
6  Ashwini     99  Female

>Print name of the Column

In [31]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [32]:
df1.index

RangeIndex(start=0, stop=7, step=1)

>Sort the DataFrame as per The Marks Column

In [33]:
df1

      Name  Marks  Gender
0   Akshay     98    Male
1     Neha     89  Female
2    Swati     99  Female
3   Vedant     87    Male
4   Satish     90    Male
5   Mitali     83  Female
6  Ashwini     99  Female

In [34]:
df1.sort_values(by = 'Marks') #In ascending form

      Name  Marks  Gender
5   Mitali     83  Female
3   Vedant     87    Male
1     Neha     89  Female
4   Satish     90    Male
0   Akshay     98    Male
2    Swati     99  Female
6  Ashwini     99  Female

In [35]:
df1.sort_values(by = 'Marks',ascending = False ) #Descending form

      Name  Marks  Gender
2    Swati     99  Female
6  Ashwini     99  Female
0   Akshay     98    Male
4   Satish     90    Male
1     Neha     89  Female
3   Vedant     87    Male
5   Mitali     83  Female

Even we can perform by using multiple column

In [36]:
df1.sort_values(by = ['Marks','Gender'],ascending = False )

      Name  Marks  Gender
2    Swati     99  Female
6  Ashwini     99  Female
0   Akshay     98    Male
4   Satish     90    Male
1     Neha     89  Female
3   Vedant     87    Male
5   Mitali     83  Female

>Display Name & Marks of the female students

In [37]:
df1[df1['Gender'] =='Female'][['Marks','Name']]

   Marks     Name
1     89     Neha
2     99    Swati
5     83   Mitali
6     99  Ashwini

In [38]:
df1[df1['Gender'].isin(['Female'])][['Marks','Name']]

   Marks     Name
1     89     Neha
2     99    Swati
5     83   Mitali
6     99  Ashwini